{
  "posts": [ 
        {
      "id": "2026-01-21",
      "date": "2026-01-21",
      "title": "Quick Late Night Chat",
      "content": "Hello everyone. This entry will be pretty short. I do not have much to say. After work I started watching Death Note then I worked on this app (the kind of app you you get adds for on Instagram that are really dumb) then continued Death Note which I have now took a break on to write here.\n\nFeeling weird tonight. I don't know if it's because of the show or what but just weird feelings tonight. I think Tuesdays are weird for me because I just worked the past two days, and today, and still have two days ahead of me. It's like my Wednesday of a normal persons work week. But lets try and turn this night around with some positive thoughts! \n\nLet's start with Salma. Salma is the pretty cat that is my current twitter avi (bottom of about tab for link) and she has been my rock recently. I went out and got her a BUNCH of new toys which she has been in love with. Constantly playing and when I have slow moments during my hours of work I chase her around my room and play with the toys with her. I also FINALLY found treats that she LOVES. She was very anti treats and I could never figure out why but randomly decided to buy a different kind of treat and she loves them. Eats them right up. I also had a red dot youtube playing on my projector pointed at the wall and oh my god the videos I took of that is so funny, her just chasing the red dot going back and forth on my wall. AND SHE LOVES THE SNOW!!! I put her leash on her which was a hard task and took her to my backyard this weekend when it snowed and I thought it was going to be a quick trip but she was running and jumping and playing IN THE SNOW!!! It was so cute. She's awesome and in a couple weeks she will have a whole apartment to run around in and I can't wait for that. She deserves that. \n\nI am not sure what else to say. Time moves so slowly at night sometimes like tonight and I'm excited to sleep even though that won't happen until at least 2am. I have played any video games since before new years, I've been drinking SO much water everyday, and I have whole skin care routine but I think I might go back on Accutane which I am currently 0/3 for making it past month 2 but I think I can do it this time.\n\nI also lost my vape at the snow strippers concert and haven't bought another since and that was like a week ago so I guess that's kind of big even though I always knew I could just cold turkey quit whenever I wanted and I guess I proved myself right. \n\nAnyways I think that's all I have for tonight. It's currently 11:26pm and I'm going to upload this to the site now even though it's not 12 yet but that's okay! Thank you for reading if you did. \n\n**Much love**"
    },
        {
      "id": "2026-01-20-1",
      "date": "2026-01-20",
      "title": "January is SO long",
      "content": "Hi everyone. Two post in one day wow wow wow look at that. That is what I like about this, I can post as much as I want on here and everything gets sorted still so I don't need to worry about anything. Well anyways lets talk! January is always the longest month EVER then we go into February which normal only is fun for valentines day but I have things to look forward to this year so lets go over that!\n\nI think I'm going to get an eyebrow piercing. I really want to have a whole new look and I feel like this is a great first step. Just a couple things I'm nervous about like what if it doesn't even look good? I can't do a nose piercing and I'm not doing a lip one and I really don't need any other ear ones so I feel this is the next best option. I think it will look cool and add to my face. I'm also nervous because all I have seen on TikTok today was people talking about the piercing being rejected and I definitely do not want that to happen. I think I'm like 100% going to do it but still just a little nervous and there's a couple things I need to do first. First is I need to move. I want to wait until I am officially in my apartment and that can be like my first adventure I go off and do, which is exciting! I also need to get my eyebrows done beforehand. I personally love my eyebrows but getting them cleaned up never hurts and right before a piercing sounds like a smart plan. So yeah regarding getting the piercing it's pretty much a done deal just need this very slow month to go a little quicker.\n\nI also really like my current hair situation. I literally go to the salon and it's not even \"let me get a haircut\" it's more like lets add more texture and layers and clean up these areas. I like that. I like that I am focused on the texture and layers right now and not going in and coming out completely different. Salons are great. Only thing is this next visit will be my last and then ill need to find someone else but that shouldn't be an issue especially with how easy the appointments are. So this is another change that I am loving about myself.\n\nI also have been thinking about coloring my nails again but I'm so on the fence about it. I feel like doing it out of nowhere is not the move but again I feel like people would like it and I like it as well. Especially when I get a design done on them too. I have also been doing some jeans shopping which actually has been really easy. Urban Outfitters was having a great deal so I bought a bunch of women's jeans (skinny waist you know) from there and WOW what a great idea. They fit so well. Only thing is some of them were a 32' inseam when I am a 30. So for two of them I just took them to get tailored and I found out its a very quick and cheap process and with the other I just kept it at 32 because I kind of like how long it is. Anyways been adding outfits to my style and doing shopping for myself which I never do and I am happy with the outcome.\n\nLong story short: New Apartment, New Piercing, New Clothes, New Start. \n\nOkay well that is it for now. I'm going to go lay in bed and watch some shows until I get a motivation kick in about an hour or so from now and then I will get back on my computer and start working on other projects. I may post again today but I am not sure! See you all then! Much love."
    },
    {
      "id": "2026-01-20",
      "date": "2026-01-20",
      "title": "Homework",
      "content": "Hi everyone, this is the 2nd post and I just watched Miami choke the college football championship my oh my. But here we are. I was given some homework and I thought posting it here would be perfect since i need to write it all out anyway for next week so lets start!\n\nQ1 - What values do you consider most important in your life? \n\nA1 - Honesty, Loyalty, Knowledge, and curiosity\n\nQ2 - What three changes can you make to live according to your personal values?\n\nA2 - One change is to be more honest to strangers. I do love lying to strangers especially while drunk but maybe I do it too much so I can slow down on that. I can Definity start learning more as I've been doing the past 3 weeks. I have been learning a lot more about performance art and reading authors I have never heard of. Lastly I can be more curious when it comes to life. I am moving in early February and that gives me the perfect opportunity to be more curious with people around me and places.\n\nQ3 - Describe yourself using the first 10 words that come to mind. Then, list 10 words that you'd like to use to describe yourself. List a few ways to transform those descriptions into reality.\n\nA3 -  First 10 words that come to mind - Skinny, Boring, Acne prone, Sad, Nervous, Excited, Big Eyes, Motivated, Artist, Unlovable\n10 Words I'd like - Funny, Intelligent, Loveable, Wanted, Open to anything, Passionate, Loyal, Patient, Intune, Creative\nWays to transform - Skin care routine which I am doing, Study and learn more, be more patient and listen before acting.\n\nQ4 - What do you appreciate most about your personality? What aspects do you find harder to accept?\n\nA4 - I love how open I am and how loyal I truly am and how much I thrive to be better in every aspect with future relationships and work ethic and knowledge. \nI find being consistent on things to be hard to accept because with consistency comes leaving a certain me in the past which is a good and bad thing.\n\nQ5 - Explore an opinion or two you held in the past but have since questioned or changed. What led you to change that opinion?\n\nA5 -  I think something I have questioned recently is if I was truly loved by people in the past or not. In my opinion I feel like I was but love is such an easy and hard thing at that the same and when you sit back and think of everything friends and past partners have done for you you have to ask yourself if it was truly love in that friendship or in that relationship or just the act of doing or even the act of not doing things for me. It's weird. It's also hard to compare what you're receiving from someone versus what others are receiving for their friends or partners because every relationship is different so it's truly just hard to come to a conclusion on if I was. \n\nQ6 - List three personal beliefs you're willing to reconsider or further explore.\n\nA6 - First one is i personally do not believe in ghost but I am willing to further explore this one and get my own answers! (I do know there's aliens out there it was like confirmed years ago) \nSecond one is I believe everyone is kind which I do not believe anymore. Some people are not nice people, they have moments but some people truly have more hate then love in their hearts and I feel sorry for them.\nLastly I believe karma is very real and I want to further explore karma and everything that comes with good and bad actions you take in life. \n\nQ7 - Finish the sentence: \"My life would be incomplete without...\"\n\nA7 - My life would be incomplete without having a group of friends who come over to my apartment / house and drink and have a good time. I really yearn for this. With my new apartment my main goal is to make a great group of friends who comes over and we just have a good time. Smoke, drink, play games, watch things. I want others to have my apartment key and come and go as they please. I want to be the person they know they can come over whenever and ill always be there for them and a place for them to escape whatever is after them. I cannot live without that. I yearn. \n\nQ8- Describe one or two significant life events that helped shape you into who you are today. \n\nA8 - I think two big life events that shaped me into who I am today is honestly my experiences in college and my romantic relationships. Without college experiences and all the up and downs that brought I would still be lost in life. And without my romantic relationships I simply wouldn't have learned how to be a better me and how to grow. All the pain that comes when things end bad only provide a chance to grow so you don't have to feel that way again and that itself is helpful regardless of the pain that needs to come first.\n\nQ9 - When do you trust yourself most? When do you find it harder to have faith your instincts? \n\nA9 - I trust myself most when I have time to process my feelings and make an opinion form there. I used to react quick and that wasn't a time where I was have trust in myself and my words but when I have time to digest and think I feel trustworthy in my words and actions. Hard to have faith in my instincts when I am reacting out of emotion, which again is something that I have found to be easy to control given time.\n\nQ10 - What three things would you most like others (loved ones, potential friends and partners, professional acquaintances, etc.) to know about you?\n\nA10 - I would like others to know how down I am for anything. I will rarely say no to an event or an outing or an idea and I really like that about myself. I would also like others to know how much I care. I care so much about people especially with people I love and that care never fades. Finally I'd like others to know how dependent I am. They can always count on me to be up for them, to be at their call if needed. No matter how far the drive or train or plane I would always be there. That is something maybe I should have more self respect on but it's not something Id want to change since I love being able to be that person who is always there."
    },
        {
      "id": "2026-01-19",
      "date": "2026-01-19",
      "title": "My First Post!",
      "content": "Hello everyone, this post will be going live on 1/19/2026 and I will be uploading a post on here once a day. If I do post more then just once a day you can always check in my archives at the top right to see if I posted anything else earlier in the day. I wanted to make this website so I had somewhere to post just random thoughts and things I want to talk about. I also made a couple websites last year that were not my best work at all and I feel bad for the person since again those website were not my best work. I made this one today since work has been pretty slow and i'm really proud with how it came out. I wanted to go with a purple and green theme but very lowkey on it. Lets talk about the rest of this website real quick and everything to come.\n\n**MW at the top left**\nThis is my initals (obviously) and will take you to the home page when you click it (right where you are reading this at!) So will the **Today** Tab\n\n**Archive**\nThe archive as I explained earlier is the place where you can see all past post. Everyday there will be a current post or \"reflection\" and all the previous ones will be sent to the archive. I wanted this so others who view my website can always view my past post and for myself to reflect on what I was posting on a specific day. \n\n**Visuals**\nFor the Visuals tab this is mostly photos off Pinterest but will be adding real life ones eventually. I like the visual portion of this website to really represent me and my thoughts. Every photo on there is chosen on purpose and for a reason. Each one has a meaning that I can relate to or I can associate with. I will never have just random photos in there. \n\n**About**\nThe about me is as simple as it sounds, just a few photos of me and a little about me. It also has my socials at the bottom incase you ever want to get into contact! \n\n**Support**\nThis one might be the dumbest one but I though I would have it there incase any of my post or visuals or anything else makes someone feel that they want to support. \n\n\n> I also really like that I added this and wanted to try it out LOL, I hope it looks good!\n\n\nAnyways, that's the run down of this website. I'm really proud of how it looks currently and cannot wait to continue to add to this website. The main goal is to just post everyday about my thoughts and feelings and dreams and whatever else comes to my mind. I hope you all enjoy."
    }
  ]
}
