{
  "posts": [ 
        {
      "id": "2026-01-19",
      "date": "2026-01-19",
      "title": "My First Post!",
      "content": "Hello everyone, this post will be going live on 1/19/2026 and I will be uploading a post on here once a day. If I do post more then just once a day you can always check in my archives at the top right to see if I posted anything else earlier in the day. I wanted to make this website so I had somewhere to post just random thoughts and things I want to talk about. I also made a couple websites last year that were not my best work at all and I feel bad for the person since again those website were not my best work. I made this one today since work has been pretty slow and i'm really proud with how it came out. I wanted to go with a purple and green theme but very lowkey on it. Lets talk about the rest of this website real quick and everything to come.\n\n**MW at the top right**\nThis is my initals (obviously) and will take you to the home page when you click it (right where you are reading this at!) So will the **Today** Tab\n\n**Archive**\nThe archive as I explained earlier is the place where you can see all past post. Everyday there will be a current post or \"reflection\" and all the previous ones will be sent to the archive. I wanted this so others who view my website can always view my past post and for myself to reflect on what I was posting on a specific day. \n\n**Visuals**\nFor the Visuals tab this is mostly photos off Pinterest but will be adding real life ones eventually. I like the visual portion of this website to really represent me and my thoughts. Every photo on there is chosen on purpose and for a reason. Each one has a meaning that I can relate to or I can associate with. I will never have just random photos in there. \n\n**About**\nThe about me is as simple as it sounds, just a few photos of me and a little about me. It also has my socials at the bottom incase you ever want to get into contact! \n\n**Support**\nThis one might be the dumbest one but I though I would have it there incase any of my post or visuals or anything else makes someone feel that they want to support. \n\n\n> I also really like that I added this and wanted to try it out LOL, I hope it looks good!\n\n\nAnyways, that's the run down of this website. I'm really proud of how it looks currently and cannot wait to continue to add to this website. The main goal is to just post everyday about my thoughts and feelings and dreams and whatever else comes to my mind. I hope you all enjoy."
    }
  ]
}
